Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: #### The Cons ####
es: ### Desventajas ###

source: Or you can have Git try to automatically fix the issue before applying the patch:
es: O puedes pedirle que intente corregir automáticamente los problemas antes de aplicar el parche:

source: Sometimes, developers want to get a combination of a large project’s subdirectories, depending on what team they’re on.
es: Algunas veces, dependiendo del equipo de trabajo en que se encuentren, los desarrolladores suelen necesitar mantener una combinación de grandes carpetas de proyecto.

source: If you’re applying a number of patches from an mbox, you can also run the `am` command in interactive mode, which stops at each patch it finds and asks if you want to apply it:
es: Al aplicar varios parches desde un mbox, puedes lanzar el comando 'am' en modo interactivo; haciendo que se detenga en cada parche y preguntandote si aplicarlo o no:

source: So, let’s do an actual Git command — you’ll clone the Gitosis control repository:
es: Por tanto, intentalo con un comando Git real --por ejemplo, clonar el propio repositorio de control de Gitosis

source: If that happens, you see an error like this:
es: En estos casos, se suele ver un error tal como:

source: For instance, Xcode projects on the Mac contain a file that ends in `.pbxproj`, which is basically a JSON (plain text javascript data format) dataset written out to disk by the IDE that records your build settings and so on.
es: Por ejemplo, los proyectos Xcode en un Mac contienen un archivo terminado en '.pbxproj'. Este archivo es básicamente una base de datos JSON (datos javascript en formato de texto plano), escrita directamente por el IDE para almacenar aspectos tales como tus ajustes de compilación.

source: Whether you maintain a canonical repository or want to help by verifying or approving patches, you need to know how to accept work in a way that is clearest for other contributors and sustainable by you over the long run.
es: Tanto si gestionas un repositorio canónico, como si deseas colaborar verificando o aprobando parches, necesitas saber cómo aceptar trabajo de otros de la forma más clara para tus contribuyentes y más sostenible para tí a largo plazo.

source: In the following examples, and throughout most of this book, for the sake of brevity I don’t format messages nicely like this; instead, I use the `-m` option to `git commit`.
es: En los ejemplos siguientes, y a lo largo de todo este libro, por razones de brevedad no formatearé correctamente los mensajes; sino que emplearé la opción '-m' en los comandos 'git commit'.

source: The repo.or.cz and GitHub hosting sites both support this, and many project maintainers expect this style of contribution.
es: Los sitios como repo.or.cz ó GitHub permiten realizar esto, y muchos gestores de proyectos esperan este estilo de contribución.

source: Git will automatically add group write permissions to a repository properly if you run the `git init` command with the `--shared` option.
es: Git añadirá automáticamente permisos de escritura al grupo sobre cualquier repositorio donde lances el comando 'git init' con la opción '--shared'.

source: If you’re taking patches over e-mail prepared by `git format-patch`, then some of these may be helpful to you.
es: Si recibes parches a través de corrreo-e preparados con 'git format-patch', es posible que parte de lo descrito en esta sección te pueda ser util.

source: Exiting non-zero from this hook aborts the commit, although you can bypass it with `git commit --no-verify`.
es: Saliendo con un valor de retorno distinto de cero, se aborta la confirmación de cambios. Aunque siempre puedes saltartelo con la orden 'git commit --no-verify'.

source: If you really do want to delete the branch and lose that work, you can force it with `-D`, as the helpful message points out.
es: Si realmente deseas borrar la rama, y perder el trabajo contenido en ella, puedes forzar el borrado con la opción '-D'; tal y como lo indica el mensaje de ayuda.

source: Insert 18333fig0329.png Figure 3-29.
es: Insert 18333fig0329.png Figura 3-29.

source: This gives you a local branch that you can work on that starts where `origin/serverfix` is.
es: Esto sí te da una rama local donde puedes trabajar, comenzando donde 'origin/serverfix' estaba en ese momento.

source: If you have multiple submodules, you’ll have multiple entries in this file.
es: En caso de haber múltipes submódulos, habrá multiples entradas en este archivo.

source: For instance, you might resolve this conflict by replacing the entire block with this:
es: Por ejemplo, puedes optar por cambiar el bloque, dejandolo tal que:

source: - Typically a hyphen or asterisk is used for the bullet, preceded by a single space, with blank lines in between, but conventions vary here
es: - Habitualmente se emplea un guión o un asterisco como bolo, seguido de un espacio, con líneas en blanco intermedias; pero las convenciones pueden variar.

source: Other maintainers prefer to rebase or cherry-pick contributed work on top of their master branch, rather than merging it in, to keep a mostly linear history.
es: Otros gestores de mantenimiento, al procesar el trabajo recibido de las personas colaboradoras, en lugar de fusiones (merge), suelen preferir reorganizar (rebase) o entresacar (cherry-pick) sobre su propia rama principal; obteniendo así un historial prácticamente lineal.

source: You can tell Git which of these you want enabled by setting `core.whitespace` to the values you want on or off, separated by commas.
es: Puedes decir a Git cuales de ellos deseas activar o desactivar, ajustando el parámetro 'core.whitespace' con los valores on/off separados por comas.

source: For example, suppose you want to split the middle commit of your three commits.
es: Por ejemplo, si se desea dividir la confirmación de cambios de enmedio de entre las tres citadas en ejemplos anteriores.

source: Instead of "updated README formatting and added blame", you want to split it into two commits: "updated README formatting" for the first, and "added blame" for the second.
es: Es decir, si en lugar de "updated README formatting and added blame", se desea separar esa confirmación en dos: "updated README formatting" y "added blame".

source: What is the significance of that?
es: ¿Cuál es el significado de todo esto?.

source: Another simple option for public unauthenticated access is to start a Git daemon, although that requires you to daemonize the process - we’ll cover this option in the next section, if you prefer that route.
es: Otra opción simple para habilitar accesos públicos sin autentificar, es arrancar el demonio Git, aunque esto supone demonizar el proceso. (Se verá esta opción en la siguiente sección.)

source: In order to clone your repository to create a new bare repository, you run the clone command with the `--bare` option.
es: Tan solo has de utilizar el comando 'clone' con la opción '--bare'.

source: You’ve just gone over Git’s three main object types, but there is a fourth.
es: Acabas de conocer los tres principales tipos de objetos Git, pero hay un cuarto.

source: When you save and exit the editor, Git rewinds you back to the last commit in that list and drops you on the command line with the following message:
es: Cuando se guarde y cierre en el editor, Git hará un rebobinado hacia atras hasta la última de las confirmaciones de cambios en la lista, y mostrará algo así como:

source: Let’s go through a simple example of branching and merging with a workflow that you might use in the real world.
es: Vamos a presentar un ejemplo simple de ramificar y de fusionar, con un flujo de trabajo que se podría presentar en la realidad.

source: You can get a list of the SHA-1 values of all the commits that are being pushed by taking the `$newrev` and `$oldrev` values and passing them to a Git plumbing command called `git rev-list`.
es: Puedes obtener la lista de las claves SHA-1 de todos las confirmaciones de cambios enviadas cogiendo los valores de '$newrev' y de '$oldrev', y pasandolos a comando de mantenimiento de Git llamado 'git rev-list'.

source: Put the following line in your `.gitattributes` file:
es: Poniendo lo siguiente en tu archivo '.gitattributes':

source: That’s basically what a branch in Git is: a simple pointer or reference to the head of a line of work.
es: Esto es lo que es básicamente una rama en Git: un simple apuntador o referencia a la cabeza de una línea de trabajo.

source: Some of the variables involved are active contributor size, chosen workflow, your commit access, and possibly the external contribution method.
es: Algunas de las variables a considerar son: la cantidad de colaboradores activos, la forma de trabajo escogida, el nivel de acceso que tengas, y, posiblemente, el sistema de colaboración externa implantado.

source: On an Ubuntu machine, you use an Upstart script.
es: En una máquina Ubuntu, puedes usar un script de arranque.

source: To tell Git to treat all `pbxproj` files as binary data, add the following line to your `.gitattributes` file:
es: Para indicar a Git que trate todos los archivos 'pbxproj' como binarios, puedes añadir esta línea a tu archivo '.gitattriutes':

source: If all your commit messages look like this, things will be a lot easier for you and the developers you work with.
es: Si todas tus confirmaciones de cambio (commit) llevan mensajes de este estilo, facilitarás las cosas tanto para tí como para las personas que trabajen contigo.

source: After they integrate these branches into the mainline, a fetch will bring down the new merge commits, making the commit history look like Figure 5-14.
es: Despues de que dichas ramas sean integradas en la línea principal, una recuperación (fetch) traerá de vuelta las confirmaciones de cambios de las integraciones (merge commits), dejando un historial como el mostrado en la Figura 5-14.

source: Clicking the "I agree, sign me up" button takes you to your new user dashboard (see Figure 4-4).
es: Clicando sobre el botón de "Estoy de acuerdo, registramé" ("I agree, sign me up"), irás al panel de control de tu recién creado usuario.

source: Notice the reverse order.
es: Prestar atención al orden inverso.

source: Let’s create a hotfix branch on which to work until it’s completed (see Figure 3-13):
es: Vamos a crear una nueva rama 'hotfix', sobre la que trabajar hasta resolverlo (ver Figura 3-13):

source: This approach also makes it easier to pull out or revert one of the changesets if you need to later.
es: Además, esta manera de trabajar facilitará la integración o el descarte individual de alguno de los cambios, en caso de ser necesario.

source: Suppose you clone from a central server and then do some work off that.
es: Imaginate que haces un clon desde un servidor central, y luego trabajas sobre él.

source: Because it contains work that isn’t merged in yet, trying to delete it with `git branch -d` will fail:
es: Debido a que contiene trabajos sin fusionar aún, al intentarla borrar con 'git branch -d', el comando nos dará un error:

source: Git automatically creates a new commit object that contains the merged work.
es: Git crea automáticamente una nueva confirmación para la fusión.

source: It’s best to have a clean working state when you switch branches.
es: Lo mejor es tener siempre un estado de trabajo limpio y despejado antes de saltar entre ramas.

source: If you’re running a Mac, Leopard comes preinstalled with Ruby, so `webrick` may be your best bet.
es: Si tienes una máquina Mac, Leopard trae preinstalado Ruby, por lo que 'webrick' puede ser tu mejor apuesta.

source: Git comes preset to use a number of other merge-resolution tools without your having to set up the cmd configuration.
es: Git viene preparado para utilizar bastantes otras herramientas de resolución de conflictos, sin necesidad de andar ajustando la configuración de cdm.

source: You first add the Rack application to your project.
es: Se comienza añadiendo la aplicación Rack al proyecto.

source: If you try, you’ll see a login rejection like this:
es: Si pruebas a hacerlo, recibiras un rechazo de inicio de sesión:

source: This is a special daemon that comes packaged with Git; it listens on a dedicated port (9418) that provides a service similar to the SSH protocol, but with absolutely no authentication.
es: es un demonio (daemon) especial, que viene incorporado con Git. Escucha por un puerto dedicado (9418), y nos da un servicio similar al del protocolo SSH; pero sin ningún tipo de autentificación.

source: Behind big corporate firewalls, this obscure port is commonly blocked.
es: Normalmente, este oscuro puerto suele estar bloqueado detrás de los cortafuegos corporativos.

source: I’ll demonstrate setting up the Perforce Visual Merge Tool (P4Merge) to do your diffs and merge resolutions, because it’s a nice graphical tool and it’s free.
es: Lo voy a demostrar configurando Perforce Visual Merge como herramienta para realizar las comparaciones y resolver conflictos; ya que es una buena herramienta gráfica y es libre.

source: Take a history like Figure 3-31, for example.
es: Por ejemplo, sea un registro como el de la Figura 3-31.

source: If you use the ACL structure returned from the `get_acl_access_data` method and check it against the listed files in each of the commits, you can determine whether the user has access to push all of their commits:
es: Utilizando la estructura ACL devuelta por el método 'get_acl_access_data' y comprobandola sobre la lista de archivos de cada confirmación de cambios, puedes determinar si el usuario tiene o no permiso para enviar dichos cambios:

source: The main reason to specify the `file://` prefix is if you want a clean copy of the repository with extraneous references or objects left out — generally after an import from another version-control system or something similar (see Chapter 9 for maintenance tasks).
es: La única razón que puedes tener para indicar expresamente el prefijo 'file://' puede ser el querer una copia limpia del repositorio, descartando referencias u objetos superfluos. Normalmente, tras haberlo importado desde otro sistema de control de versiones o algo similar (ver el Capítulo 9 sobre tareas de mantenimiento).

source: If you run that command before committing, you can tell if you’re about to commit whitespace issues that may annoy other developers.
es: Lanzando este comando antes de confirmar cambios, puedes estar seguro de si vas o no a incluir problemas de espaciado que puedan molestar a otros desarrolladores.

source: Then, Git spits out a bunch of log information looking something like this for each patch you’re sending:
es: Tras esto, Git escupirá una serie de información de registro, con pinta más o menos como esta:

source: If you run a `git log` when your history looks like this, you’ll see two commits that have the same author date and message, which will be confusing.
es: Si lanzas un 'git log' en un registro como este, verás dos confirmaciones con el mismo autor, misma fecha y mismo mensaje. Lo que puede llevar a confusiones.

source: You can also specify multiple refspecs for fetching in your configuration file.
es: Es posible asimismo indicar referencias multiples en el archivo de configuración.

source: If you type `2` or `u` at the `What now>` prompt, the script prompts you for which files you want to stage:
es: Tecleando '2' o 'u' (update) tras el indicador 'What now>', el script interactivo preguntará cuales son los archivos que se quieren añadir al área de preparación:

source: Now, your local branch sf will automatically push to and pull from origin/serverfix.
es: Así, tu rama local 'sf' va a llevar (push) y traer (pull) hacia o desde 'origin/serverfix'.

source: ### Exporting Your Repository ###
es: ### Exportación del repositorio ###

source: History with several topic branches.
es: Historial con varias ramas puntuales.

source: Not nearly as many configuration options are available for the server side of Git, but there are a few interesting ones you may want to take note of.
es: No hay tantas opciones de configuración en el lado servidor de Git. Pero hay unas pocas interesantes que merecen ser tenidas en cuenta.

source: Git has initialized the `objects` directory and created `pack` and `info` subdirectories in it, but there are no regular files.
es: Git ha inicializado la carpeta 'objects', creando en ella las subcarpetas 'pack' e 'info'; pero aún no hay archivos en ellas.

source: First you notice the `.gitmodules` file.
es: Una: el archivo `.gitmodules`.

source: She chooses to merge in `issue54` first:
es: Elige fusionar primero 'issue54':

source: On a project for which you’re not the maintainer, it’s generally easier to have a branch like `master` always track `origin/master` and to do your work in topic branches that you can easily discard if they’re rejected.
es: En un proyecto del que no seas gestor, suele ser más sencillo tener una rama tal como 'master' siguiendo siempre a la rama 'origin/master'; mientras realizas todo tu trabajo en otras ramas puntuales, que podrás descartar facilmente en caso de que alguna de ellas sea rechazada.

source: If you look at the resulting tree, you can see the SHA-1 value your repo.rb file got for the blob object:
es: Si hechas un vistazo al árbol resultante, podrás observar el valor SHA-1 del objeto binario correspondiente a dicho archivo repo.rb:

source: Start with the first tree you wrote:
es: Empezando por el primer árbol que has escrito:

source: First, create a new file and save its contents in your database:
es: Para ello, crea un archivo nuevo y guarda su contenido en tu base de datos:

source: Your commit history will look something like Figure 3-20.
es: El registro de confirmaciones (commit history) será algo parecido a la Figura 3-20.

source: In fact, if you build Git from source code cloned from the Git repository, `git --version` gives you something that looks like this.
es: Es más, si compilas Git desde código fuente clonado desde el repositorio Git, el comando 'git --version' te dará algo parecido.

source: It adds, removes, and modifies files automatically to make sure your working copy is what the branch looked like on your last commit to it.
es: Git añade, quita y modifica archivos automáticamente. Para asegurarte que tu copia de trabajo es exactamente tal y como era la rama en la última confirmación de cambios realizada sobre ella.

source: ### Single Revisions ###
es: ### Confirmaciones puntuales ###

source: Now that you can specify individual commits, let’s see how to specify ranges of commits.
es: Una vez vistas las formas de referirse a confirmaciones concretas de cambios. Vamos a ver cómo referirse a un grupo de confirmaciones.

source: There are a couple of interesting things here.
es: Tenemos un para de aspectos interesantes aquí.

source: It’s not perfect — it adds a bunch of random stuff at the end — but it certainly works.
es: No es perfecto, --añade bastante basura aleatoria al final--, pero realmente funciona.

source: Next, you clone and install Gitosis from the project’s main site:
es: A continuación, has de clonar e instalar Gitosis desde el repositorio principal de su proyecto:

source: If you have a small team or are already comfortable with a centralized workflow in your company or team, you can easily continue using that workflow with Git.
es: Si tienes un equipo pequeño o te sientes confortable con un flujo de trabajo centralizado, puedes continuar usando esa forma de trabajo con Git.

source: Changes you submit may be rendered obsolete or severely broken by work that is merged in while you were working or while your changes were waiting to be approved or applied.
es: Los cambios que envies pueden quedar obsoletos o severamente afectados por otros trabajos que han sido integrados previamente mientras tú estabas trabajando o mientras tus cambios aguardaban a ser aprobados para su integración.

source: People still won’t be able to log in, but Gitosis will control that for you.
es: Los usuarios no podrán todavia iniciar sesión, pero Gitosis se encargará de ello.

source: Insert 18333fig0331.png Figure 3-31.
es: Insert 18333fig0331.png Figura 3-31.

source: You get a list of commits that have already been pushed up by running this:
es: La lista de confirmaciones de cambio previamente enviadas, se comprueba con:

source: Insert 18333fig0527.png Figure 5-27.
es: Insert 18333fig0527.png Figura 5-27.

source: The next time you check out this file, Git injects the SHA of the blob:
es: La próxima vez que extraigas el archivo, Git le habrá inyectado el SHA del objeto binario (blob):

source: When you’re done and want to shut down the server, you can run the same command with the `--stop` option:
es: Cuando ya has terminado y quieras apagar el servidor, puedes lanzar el mismo comando con la opción '--stop'.

source: As you type, a helper pops up, showing you possible username matches.
es: Según tecleas, aparecerá un cuadro de ayuda, mostrando posibles nombres de usuario que encajen con lo tecleado.

source: Git addresses this issue using submodules.
es: Git resuelve estas problemáticas utilizando submódulos.

source: There is no difference in the end product of the integration, but rebasing makes for a cleaner history.
es: No hay ninguna diferencia en el resultado final de la integración, pero el haberla hecho reorganizando nos deja un registro más claro.

source: An alternative would be to push this new work to a different branch on the server (perhaps called `featureAv2`).
es: Una alternativa podría ser el enviar (push) este nuevo trabajo a una rama diferente del servidor (por ejemplo a 'featureAv2').

source: So, if you see that a method in your code is buggy, you can annotate the file with `git blame` to see when each line of the method was last edited and by whom.
es: Así, cuando se está frente a una porción de código con problemas, se puede emplear el comando `git blame` para anotar ese archivo y ver así cuándo y por quién fue editada por última vez cada una de sus líneas.

source: The `-w` tells `hash-object` to store the object; otherwise, the command simply tells you what the key would be.
es: La opción '-w' indica a 'hash-object' que ha de guardar el objeto; de otro modo, el comando solo te respondería cual sería su clave.

source: It takes only a few minutes to do.
es: En tan solo unos minutos.

source: Finally, the `post-merge` hook runs after a successful `merge` command.
es: Y, por último, el punto de enganche 'post-merge' se activa tras completarse la ejecución de un comando 'git merge'.

source: Now Git knows that if it tries to do a diff between two snapshots, and any of the files end in `.doc`, it should run those files through the "word" filter, which is defined as the `strings` program.
es: A partir de ahora, Git sabe que si intenta realizar una comparación entre dos momentos determinados (snapshots), y si cualquiera de los archivos a comparar termina en '.doc', tiene que pasar antes esos archivos por el filtro "word", es decir, por el programa 'strings'.

source: By default, Git populates this directory with a bunch of example scripts, many of which are useful by themselves; but they also document the input values of each script.
es: Por defecto, esta carpeta contiene unos cuantos scripts de ejemplo. Algunos de ellos son útiles por sí mismos; pero su misión principal es la de documentar las variables de entrada para cada script.

source: This process is similar across all operating systems.
es: El proceso para hacerlo es similar en casi cualquier sistema operativo.

source: People must have access to your machine over SSH to access it, even in a read-only capacity, which doesn’t make SSH access conducive to open source projects.
es: Todos han de tener configurado un acceso SSH al servidor, incluso aunque sea con permisos de solo lectura; lo que no lo hace recomendable para soportar proyectos abiertos.
